In [4]:
#import related libraries

import pandas as pd
from sqlalchemy import create_engine

import warnings 
warnings.filterwarnings("ignore")

In [2]:
df=pd.read_csv(r"C:\Users\HP\Downloads\Hotel_sales.csv")

In [3]:
#dimensions of data
df.shape

(527510, 12)

In [4]:
#first five columns of dataset
df.head()

,Branch_Name,Business_Date,Invoice_Time,Invoice_Number,Order_Source,Sale_Item_Qty,Gross_Amount,Discounts,Category,Payment_Modes,City,Day
0,01.JNC,01-12-2024,00:05:00,JNC/24-25/82307,swiggy,1,199,0.0,Dlite Biryani,Swiggy,Bangalore,Sunday
1,01.JNC,01-12-2024,00:07:00,JNC/24-25/82308,swiggy,1,199,0.0,Dlite Biryani,Swiggy,Bangalore,Sunday
2,01.JNC,01-12-2024,00:11:00,JNC/24-25/82309,swiggy,1,199,0.0,Dlite Biryani,Swiggy,Bangalore,Sunday
3,01.JNC,01-12-2024,00:19:00,JNC/24-25/82310,swiggy,1,299,0.0,Chicken Biryani,Swiggy,Bangalore,Sunday
4,01.JNC,01-12-2024,00:21:00,JNC/24-25/82311,swiggy,1,299,0.0,Chicken Biryani,Swiggy,Bangalore,Sunday

In [5]:
#last five columns of dataset
df.tail()

,Branch_Name,Business_Date,Invoice_Time,Invoice_Number,Order_Source,Sale_Item_Qty,Gross_Amount,Discounts,Category,Payment_Modes,City,Day
527505,17.SARJAPURA,31-12-2024,23:43:00,SAR/24-25/71018,POS,1,20,-2.0,"Soft Drinks, Desserts and Extra",BharatPe,Bangalore,Tuesday
527506,17.SARJAPURA,31-12-2024,23:43:00,SAR/24-25/71018,POS,1,2,-0.2,"Soft Drinks, Desserts and Extra",BharatPe,Bangalore,Tuesday
527507,17.SARJAPURA,31-12-2024,23:50:00,SAR/24-25/71019,POS,1,199,0.0,Dlite Biryani,Swiggy,Bangalore,Tuesday
527508,17.SARJAPURA,31-12-2024,23:50:00,SAR/24-25/71019,POS,1,40,0.0,"Soft Drinks, Desserts and Extra",Swiggy,Bangalore,Tuesday
527509,17.SARJAPURA,31-12-2024,23:52:00,SAR/24-25/71020,POS,1,499,0.0,Chicken Kabab Biryani,Zomato,Bangalore,Tuesday

In [6]:
#information about data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 527510 entries, 0 to 527509
Data columns (total 12 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Branch_Name     527510 non-null  object
 1   Business_Date   527510 non-null  object
 2   Invoice_Time    527510 non-null  object
 3   Invoice_Number  527510 non-null  object
 4   Order_Source    527510 non-null  object
 5   Sale_Item_Qty   527510 non-null  int64
 6   Gross_Amount    527510 non-null  int64
 7   Discounts       527510 non-null  float64
 8   Category        527510 non-null  object
 9   Payment_Modes   527510 non-null  object
 10  City            527510 non-null  object
 11  Day             527510 non-null  object
dtypes: float64(1), int64(2), object(9)
memory usage: 48.3+ MB

In [7]:
df["Business_Date"]=pd.to_datetime(df["Business_Date"],format='%d-%m-%Y')
df["Invoice_Time"]=pd.to_datetime(df["Invoice_Time"],format='%H:%M:%S')

In [8]:
#converting object to datetime
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 527510 entries, 0 to 527509
Data columns (total 12 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Branch_Name     527510 non-null  object
 1   Business_Date   527510 non-null  datetime64[ns]
 2   Invoice_Time    527510 non-null  datetime64[ns]
 3   Invoice_Number  527510 non-null  object
 4   Order_Source    527510 non-null  object
 5   Sale_Item_Qty   527510 non-null  int64
 6   Gross_Amount    527510 non-null  int64
 7   Discounts       527510 non-null  float64
 8   Category        527510 non-null  object
 9   Payment_Modes   527510 non-null  object
 10  City            527510 non-null  object
 11  Day             527510 non-null  object
dtypes: datetime64[ns](2), float64(1), int64(2), object(7)
memory usage: 48.3+ MB

In [9]:
#checking null values
df.isnull().sum()

Branch_Name       0
Business_Date     0
Invoice_Time      0
Invoice_Number    0
Order_Source      0
Sale_Item_Qty     0
Gross_Amount      0
Discounts         0
Category          0
Payment_Modes     0
City              0
Day               0
dtype: int64

In [10]:
#checking duplicates
df.duplicated().sum()

0

In [11]:
df["Business_Date"]=df["Business_Date"].dt.date

In [15]:
df["Invoice_Time"]=df["Invoice_Time"].dt.time

In [16]:
#summary statistics for numerical column
df.describe()

       Sale_Item_Qty   Gross_Amount      Discounts
count  527510.000000  527510.000000  527510.000000
mean        1.124705     269.646211      -5.232821
std         1.221014     469.926301      29.953670
min         0.000000       0.000000   -6069.000000
25%         1.000000     189.000000       0.000000
50%         1.000000     199.000000       0.000000
75%         1.000000     299.000000       0.000000
max       250.000000   87500.000000       0.000000

In [5]:
username='root'
password='keert1701'
host=127
port=3306
database='hotel'
engine = create_engine("mysql+pymysql://root:keert1701@localhost:3306/hotel")

In [18]:
df.to_sql('Hotel_Sales',con=engine,if_exists='replace',index=False)

527510